// 地图模拟数据
export const echartsMapList = [
	{ name: '深圳市人民政府', value: '100' },
	{ name: '莲花山公园', value: '100' },
	{ name: '世界之窗', value: '100' },
	{ name: '华侨城欢乐谷', value: '100' },
	{ name: '宝安区西乡', value: '100' },
];

// 地图经纬度数据
export const echartsMapData: object = {
	深圳市人民政府: [114.064524, 22.549225],
	莲花山公园: [114.0658, 22.560072],
	世界之窗: [113.979419, 22.540579],
	华侨城欢乐谷: [113.986066, 22.548056],
	宝安区西乡: [113.869053, 22.581714],
};

// 地图图片显示
export const echartsMapImgs = [
	{
		url: 'https://img1.baidu.com/it/u=2425496005,2401702709&fm=253&fmt=auto&app=120&f=JPEG?w=500&h=500',
		name: '深圳市人民政府',
		add: '深圳市福田区福中三路市民中心C区',
		dec: '深圳市人民政府是根据《中华人民共和国地方各级人民代表大会和地方各级人民政府组织法》设立的，是深圳市人民代表大会的执行机关，是深圳市的国家行政机关。',
	},
	{
		url: 'https://img0.baidu.com/it/u=2666213152,2487785512&fm=253&fmt=auto&app=120&f=JPEG?w=500&h=500',
		name: '莲花山公园',
		add: '广东省深圳市福田区莲花街道莲花北社区红荔路6030号',
		dec: '莲花山公园筹建于1992年10月10日 ，1997年6月23日正式对外局部开放。',
	},
	{
		url: 'https://img1.baidu.com/it/u=1595204841,1838139326&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500',
		name: '世界之窗',
		add: '深圳市南山区深南大道9037号',
		dec: '这里，世界首座实景拍摄悬空式球幕影院“飞跃美利坚””，为游客提供集休闲放松于一体的都市时尚生活空间。',
	},
	{
		url: 'https://img0.baidu.com/it/u=1586832283,2276617306&fm=253&fmt=auto&app=138&f=JPEG?w=476&h=500',
		name: '华侨城欢乐谷',
		add: '广东省深圳市南山区沙河街道星河街社区侨城西街1号',
		dec: '深圳欢乐谷注重满足人们参与、体验的新型诱游需求，营造出自然、清新、活泼、惊奇、热烈、刺激的休闲旅游氛围。',
	},
	{
		url: 'https://img0.baidu.com/it/u=2899429152,3158963267&fm=253&fmt=auto&app=138&f=JPEG?w=200&h=200',
		name: '宝安区西乡',
		add: '西乡街道下辖25个社区',
		dec: '西乡街道，隶属于广东省深圳市宝安区，位于宝安区西南部，东接石岩街道，南接新安街道，西至珠江口岸边，北接航城街道。',
	},
];
