<template>
	<view>
		<view class="logo">用户使用服务条款</view>
		<view class="txt"><div v-html="html"></div></view>
	</view>
</template>

<script>
export default {
	data() {
		return {
			html: `
				<span>为使用腾讯的服务，您应当阅读并遵守《腾讯服务协议》（以下简称“本协议”）和《腾讯隐私政策》。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制腾讯责任的条款、对用户权利进行限制的条款、约定争议解决方式和司法管辖的条款（如第十八条相关约定）等，以及开通或使用某项服务的单独协议或规则。限制、免责条款或者其他涉及您重大权益的条款可能以加粗、加下划线等形式提示您重点注意。</span>
				<p>一、【协议的范围】</p>
				<p>1.1本协议是用户与腾讯之间关于其使用腾讯的服务所订立的协议。“腾讯”是指腾讯和/或其相关服务可能存在的运营关联单位。“用户”是指腾讯的服务的使用人，在本协议中更多地称为“您”。</p>
				<p>1.2腾讯的服务是指腾讯向用户提供的，包括但不限于即时通讯、网络媒体、互联网增值、互动娱乐、金融支付、广告等产品及服务，具体服务以腾讯实际提供的为准（以下简称“本服务”）。</p>
				<p>二、【帐号与密码安全】</p>
				<p>2.1您在使用本服务时可能需要注册一个帐号。关于您使用帐号的具体规则，请仔细阅读并遵守相关单独协议。</p>
				<p>2.2腾讯特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受被盗号或密码失窃，责任由您自行承担。</p>
				<p>三、【用户个人信息保护】</p>
				<p>3.1保护用户个人信息是腾讯的一项基本原则。腾讯将按照本协议及《腾讯隐私政策》（链接地址：http://privacy.qq.com/）的规定收集、使用、储存和分享您的个人信息。本协议对个人信息保护相关内容未作明确规定的，均应以《腾讯隐私政策》的内容为准。</p>
				<p>3.2您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则可能无法使用本服务或在使用过程中受到限制。</p>
				<p>3.3一般情况下，您可根据相关产品规则浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
				<p>3.4腾讯将尽可能运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
				<p>四、【用户违法违规行为】</p>
				<p>（1）反对宪法所确定的基本原则的。</p>
				<p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的。</p>
				<p>（3）损害国家荣誉和利益的。</p>
				<p>（4）煽动民族仇恨、民族歧视，破坏民族团结的。</p>
				<p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的。</p>
				<p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的。</p>
				<p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的。</p>
				<p>（8）侮辱或者诽谤他人，侵害他人合法权益的。</p>
				<p>（9）违反法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的。</p>
				<p>（10）相关法律法规或本协议、相关协议、规则等禁止的。</p>
				<p>五、【其他】</p>
				<p>20.1如果您对本协议或本服务有意见或建议，可与腾讯客户服务部门联系（kf.qq.com），我们会给予您必要的帮助。（正文完）</p>
			`
		};
	}
};
</script>

<style lang="scss">
page {
	background-color: $page-bg-color;
}
.logo {
	font-size: $uni-font-size-lg;
	text-align: center;
	padding: 28upx 0;
}

.txt {
	padding: 0 28upx;
	text-indent: 2em;
	font-size: $uni-font-size-base;
	line-height: 64upx;
}
</style>
